#include <header.h>
using namespace std;

int main()
{
    int A[81][9];                       //основная матрица
    int A1[81][9];                      //матрица-копия для проверки того что вычеркивание закончилось
    int A2[81];                         //матрица, задающая соседство по блоку
    int A3[81][9];                      //матрица-копия для работы в одном объекте
    int A4[81][9];                      //буферная матрица для проверки отсутсвия элементов в объекте
    for (int i = 0; i <= 80; i++) {                                 //заполнение матриц всеми возможными метками
        for (int j = 0; j <= 8; j++) {
            A[i][j] = j + 1;
            A1[i][j] = j + 1;
        }
        int c1 = (i % 9) + 1;
        int c2 = ((i - (i % 9)) / 9) + 1;
        if ((c1 == 1 || c1 == 2 || c1 == 3) && (c2 == 1 || c2 == 2 || c2 == 3)) {           //заполнение матрицы, задающей соседство по блоку
            A2[i] = 1;
        }
        else if ((c1 == 4 || c1 == 5 || c1 == 6) && (c2 == 1 || c2 == 2 || c2 == 3)) {
            A2[i] = 2;
        }
        else if ((c1 == 7 || c1 == 8 || c1 == 9) && (c2 == 1 || c2 == 2 || c2 == 3)) {
            A2[i] = 3;
        }
        else if ((c1 == 1 || c1 == 2 || c1 == 3) && (c2 == 4 || c2 == 5 || c2 == 6)) {
            A2[i] = 4;
        }
        else if ((c1 == 4 || c1 == 5 || c1 == 6) && (c2 == 4 || c2 == 5 || c2 == 6)) {
            A2[i] = 5;
        }
        else if ((c1 == 7 || c1 == 8 || c1 == 9) && (c2 == 4 || c2 == 5 || c2 == 6)) {
            A2[i] = 6;
        }
        else if ((c1 == 1 || c1 == 2 || c1 == 3) && (c2 == 7 || c2 == 8 || c2 == 9)) {
            A2[i] = 7;
        }
        else if ((c1 == 4 || c1 == 5 || c1 == 6) && (c2 == 7 || c2 == 8 || c2 == 9)) {
            A2[i] = 8;
        }
        else if ((c1 == 7 || c1 == 8 || c1 == 9) && (c2 == 7 || c2 == 8 || c2 == 9)) {
            A2[i] = 9;
        }
    }
    cout << endl << endl << "Finished";
    return 0;
}